---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.PathFailures
source: html/c70c8471-f2bb-a445-4531-8ddb6406c2cc.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PathFailures

Failures about Path.

## Syntax (C#)
```csharp
public static class PathFailures
```